In [1]:
import pandas as pd
import numpy as np

In [10]:
rng = np.random.default_rng(42)
ser = pd.Series(rng.integers(0, 10, 4))
ser

0    0
1    7
2    6
3    4
dtype: int64

In [14]:
df = pd.DataFrame(rng.integers(0, 10, (3, 4)),
                  index=['mon', 'ster', 'hunter'],
                  columns=['A', 'B', 'C', 'D'])
df

        A  B  C  D
mon     5  4  4  2
ster    0  5  8  0
hunter  8  8  2  6

In [15]:
np.exp(ser)

0       1.000000
1    1096.633158
2     403.428793
3      54.598150
dtype: float64

In [16]:
np.sin(df * np.pi / 4)

                   A             B             C    D
mon    -7.071068e-01  1.224647e-16  1.224647e-16  1.0
ster    0.000000e+00 -7.071068e-01 -2.449294e-16  0.0
hunter -2.449294e-16 -2.449294e-16  1.000000e+00 -1.0

In [17]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'Alaska': 39538223, 'Texas': 29145505,
                  'California': 21538187}, name='population')

In [18]:
population / area

Alaska        22.942827
Texas         41.896072
California    50.801565
dtype: float64

In [19]:
area.index.union(population.index)

Index(['Alaska', 'Texas', 'California'], dtype='object')

In [50]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [51]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [52]:
A = pd.DataFrame(rng.integers(0, 20, (2, 2)),
                 columns=['a', 'b'])
A

    a   b
0   6  15
1  16   8

In [53]:
B = pd.DataFrame(rng.integers(0, 10, (3, 3)),
                 columns=['b', 'a', 'c'])
B

   b  a  c
0  8  8  3
1  8  2  2
2  6  6  1

In [54]:
A + B

      a     b   c
0  14.0  23.0 NaN
1  18.0  16.0 NaN
2   NaN   NaN NaN

In [55]:
B2 = B.reindex(columns=A.columns)
result = A + B2
result = result.ffill()
result

      a     b
0  14.0  23.0
1  18.0  16.0
2  18.0  16.0

In [58]:
A.add(B, fill_value=A.values.mean())

       a      b      c
0  14.00  23.00  14.25
1  18.00  16.00  13.25
2  17.25  17.25  12.25

In [61]:
A = rng.integers(10, size=(3, 4))
A

array([[8, 5, 0, 7],
       [5, 6, 5, 5],
       [0, 5, 7, 3]])

In [66]:
A - A[0]

array([[ 0,  0,  0,  0],
       [-3,  1,  5, -2],
       [-8,  0,  7, -4]])

In [67]:
df = pd.DataFrame(A, columns=['Q', 'R', 'S', 'T'])
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -3  1  5 -2
2 -8  0  7 -4

In [68]:
df.subtract(df['R'], axis=0)

   Q  R  S  T
0  3  0 -5  2
1 -1  0 -1 -1
2 -5  0  2 -2

In [71]:
halfrow = df.iloc[0, ::2]
halfrow

Q    8
S    0
Name: 0, dtype: int64

In [72]:
df- halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -3.0 NaN  5.0 NaN
2 -8.0 NaN  7.0 NaN